
public class main {

	public static void main(String[] args) {
		//½Ç½À1
		MyHashTable ht = new MyHashTable(13);
		ht.put("201914177", "À±¿µÁø"); //6
		
		ht.put("201914178", "À±¿µÁø1"); //7
		ht.put("201914179", "À±¿µÁø2"); //8
		ht.put("201914170", "À±¿µÁø3");// 12
		ht.put("201914171", "À±¿µÁø4"); // 0
		ht.put("201914172", "À±¿µÁø5"); //1
		ht.put("201914173", "À±¿µÁø6");//2
		ht.put("201914174", "À±¿µÁø7");//3
		ht.put("201914175", "À±¿µÁø8");//4
		ht.put("201914176", "À±¿µÁø9");//5
		ht.put("201914167", "À±¿µÁø10");//5
		
		//½Ç½À2
		
		MyHashTable ht2 = new MyHashTable(13,(float)0.9);
		ht2.put("201914177", "À±¿µÁø");
		ht2.put("201914178", "À±¿µÁø1"); //7
		ht2.put("201914179", "À±¿µÁø2"); //8
		ht2.put("201914170", "À±¿µÁø3");// 12
		ht2.put("201914171", "À±¿µÁø4"); // 0
		ht2.put("201914172", "À±¿µÁø5"); //1
		ht2.put("201914173", "À±¿µÁø6");//2s
		ht2.put("201914174", "À±¿µÁø7");//3
		ht2.put("201914175", "À±¿µÁø8");//4
		ht2.put("201914176", "À±¿µÁø9");//5
		ht2.put("201914167", "À±¿µÁø10");//5
		ht2.put("201914168", "À±¿µÁø11");//5
		ht2.put("201914157", "À±¿µÁø12");//5
		ht2.put("201914158", "À±¿µÁø13");//5
		ht2.put("201914159", "À±¿µÁø14");//5
//		
		System.out.println(ht2.getLoadFactor());
		
	

	}

}
